Repository: Daniel-KM/Omeka-S-module-Table
Catalog: language/*.po
Languages: fr

source: The module %1$s should be upgraded to version %2$s or later.
fr: Le module %1$s doit être mis à niveau à la version %2$s ou ultérieure.

source: Some codes are not unique once transliterated or languages are not unique by codes or some codes have languages and some none.
fr: Certains codes ne sont pas uniques après translittération ou les langues ne sont pas uniques par code ou certains codes ont des langues et d’autres non.

source: New table
fr: Nouvelle table

source: Add new table
fr: Ajouter une nouvelle table

source: Select table
fr: Choisir une table

source: Delete tables
fr: Supprimer les tables

source: Are you sure you would like to delete the selected tables?
fr: Êtes-vous sûr de vouloir supprimer les tables sélectionnées ?

source: %1$s: this action will permanently delete %2$s tables and cannot be undone.
fr: %1$s : cette action supprimera définitivement les %2$s tables et ne pourra pas être annulée.

source: Are you sure you would like to delete all tables on all pages of this result?
fr: Êtes-vous sûr de vouloir supprimer toutes les tables du résultat ?

source: Omeka could not find any tables.
fr: Omeka ne trouve pas de table.

source: Manage multiple labels by code
fr: Gérer plusieurs libellés par code

source: Total codes
fr: Total des codes

source: Edit table
fr: Modifier la table

source: Lang
fr: Langue

source: No codes
fr: Pas de code

source: It is now possible to create table with multiple labels for one code.
fr: Il est désormais possible de créer une table avec plusieurs libellés par code.

source: It is now possible to set a language to labels. When set, all labels should have a different language.
fr: Il est désormais possible d’ajouter des langues aux libellés. Lorsque c’est le cas, tous les libellés doivent avoir des langues différentes.

source: The api output did not change for associative tables, but is different for tables with multiple labels. Check your code if needed.
fr: La sortie de l’api n’a pas changé pour les tables associatives, mais est différente pour les tables avec plusieurs labels par code. Vérifiez votre code si besoin.

source: Source (generally a url)
fr: Source (généralement une url)

source: List of code and label separated by "=", with optional language
fr: Liste des codes et libellés séparés par « = », avec une langue facultative

source: A table must have a title.
fr: Une table doit avoir un titre.

source: The codes must be an array.
fr: Les codes doivent être un tableau.

source: Some codes are not unique once transliterated: {list}.
fr: Certains codes ne sont pas uniques après translittération : {list}.

source: Some labels have not a unique language once transliterated: {list}.
fr: Certains libellés n’ont pas une langue unique après translittération : {list}.

source: A table cannot mix codes with languages and codes without languages.
fr: Une table ne peut pas mélanger des codes avec langues et des codes sans langues.

source: A slug cannot be longer than 190 characters.
fr: Un identifiant ne peut pas être plus long que 190 caractères.

source: A slug should be lower case.
fr: Un identifiant doit être en minuscule.

source: A slug should not be a numeric string.
fr: Un identifiant ne doit pas être un nombre.

source: A slug cannot be a reserved keyword.
fr: Un identifiant ne peut pas être un mot réservé.

source: The slug "{slug}" is already taken.
fr: Le nom « {slug} » est déjà utilisé.

source: The php extension "intl" is not installed, so transliteration to ascii is not managed.
fr: L’extension php « intl » n’est pas installé et la translittération vers l’ascii ne peut pas être gérée.

source: Table successfully created. {link}Add another table?{link_end}
fr: Table créée avec succès. {link}Ajouter une autre table ?{link_end}

source: Table successfully updated.
fr: Table mise à jour avec succès.

source: Table successfully deleted.
fr: Table supprimée avec succès.

source: You must select at least one table to batch delete.
fr: Vous devez choisir au moins une table à supprimer.

source: Tables successfully deleted.
fr: Table supprimée avec succès.

source: Deleting tables started in background (job {link_job}#{job_id}{link_end}, {link_log}logs{link_end}).
fr: Suppression des tables lancée en arrière plan (tâche {link_job}#{job_id}{link_end}, {link_log}journaux{link_end}).

source: Code count
fr: Total des codes
